In [1]:
import pandas as pd

In [2]:
data_frame = pd.read_csv('inflearn/friend_list.csv')

In [3]:
data_frame

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [6]:
data_frame.head(2)

    name  age        job
0   John   20    student
1  Jenny   30  developer

In [7]:
data_frame.tail(2)

    name  age      job
4  Brian   45  manager
5  Chris   25   intern

In [8]:
type(data_frame.name)

pandas.core.series.Series

In [9]:
type(data_frame.job)
#data frame은 series의 결합체

pandas.core.series.Series

In [10]:
list_tmp = [1,2,3]

In [11]:
list_tmp

[1, 2, 3]

In [12]:
s1 = pd.core.series.Series(  [1,2,3]  )

In [13]:
s2 = pd.core.series.Series(  ['one', 'two', 'three']  )

In [14]:
pd.DataFrame(data=dict(num=s1, word=s2))
#list로 series를 만들고, series로 dataframe을 만들어준다 (pandas가)

   num   word
0    1    one
1    2    two
2    3  three

In [15]:
!conda list | grep pandas

'grep'은(는) 내부 또는 외부 명령, 실행할 수 있는 프로그램, 또는
배치 파일이 아닙니다.

In [16]:
df = pd.read_csv('inflearn/friend_list.csv')

In [17]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [19]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [21]:
df = pd.read_csv('inflearn/friend_list.txt')

In [22]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [23]:
df = pd.read_csv('inflearn/friend_list_tab.txt')

In [24]:
df
#tab으로 구분된 txt file임

         name\tage\tjob
0     John\t20\tstudent
1  Jenny\t30\tdeveloper
2     Nate\t30\tteacher
3    Julia\t40\tdentist
4    Brian\t45\tmanager
5     Chris\t25\tintern

In [25]:
df = pd.read_csv('inflearn/friend_list_tab.txt', delimiter = '\t')

In [26]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [3]:
df = pd.read_csv('inflearn/friend_list_no_head.csv')

In [4]:
df

    John  20    student
0  Jenny  30  developer
1   Nate  30    teacher
2  Julia  40    dentist
3  Brian  45    manager
4  Chris  25     intern

In [5]:
df = pd.read_csv('inflearn/friend_list_no_head.csv', header = None)

In [6]:
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45    manager
5  Chris  25     intern

In [7]:
df.columns = ['name','age','job']

In [8]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [9]:
df = pd.read_csv('inflearn/friend_list_no_head.csv', header=None, names=['name','age','job'])

In [10]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [14]:
from collections import OrderedDict

In [15]:
friend_ordered_dict = OrderedDict(
    [
        ('name',['John','Nate']),
        ('age',[25,30]),
        ('job',['student','teacher'])
    ]
)

In [16]:
df = pd.DataFrame.from_dict(friend_ordered_dict)

In [17]:
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [18]:
friend_list = [
    ['John',20,'student'],
    ['Nate',30,'teacher']
]

In [19]:
column_name = ['name','age','job']

In [20]:
df = pd.DataFrame.from_records(friend_list, columns = column_name)

In [21]:
df.head()

   name  age      job
0  John   20  student
1  Nate   30  teacher

In [25]:
friends = [
    {'name' : 'John', 'age' : 25, 'job' : 'student'},
    {'name' : 'Jenny', 'age' : 30, 'job' : None},
    {'name' : 'Nate', 'age' : 30, 'job' : 'teacher'}
]
df = pd.DataFrame(friends)
df = df[['name','age','job']]  #column 순서 조정

In [26]:
df.head()

    name  age      job
0   John   25  student
1  Jenny   30     None
2   Nate   30  teacher

In [28]:
df.to_csv('inflearn/friends.csv', index=True, header=True)
#default settings

In [29]:
df.to_csv('inflearn/friends.csv', index=False, header=True)

In [30]:
df.to_csv('inflearn/friends.csv', index=False, header=False, na_rep = '-')
#N/A 값은 '-'로 대체

In [31]:
friend_list = [
    ['name', ['John','Jenny','Nate']],
    ['age', [20,30,30]],
    ['job', ['student','developer','teacher']]
]
df = pd.DataFrame.from_items(friend_list)

C:\Anaconda3\lib\site-packages\ipykernel_launcher.py:6: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.

In [32]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [33]:
df[1:3]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher